# constants.py

KBO_TEAMS = [
    {
        'name': 'LG 트윈스',
        'sub_options': ['LG - 잠실야구장 (주중)', 'LG - 잠실야구장 (금토일/공휴일)']
    },
    {
        'name': '한화 이글스',
        'sub_options': [
            '한화 - 대전 한화생명 볼파크 (1구간)',
            '한화 - 대전 한화생명 볼파크 (2구간)',
            '한화 - 대전 한화생명 볼파크 (3구간)',
            '한화 - 대전 한화생명 볼파크 (4구간)',
            '한화 - 대전 한화생명 볼파크 (스페셜)'
        ]
    },
    {
        'name': 'SSG 랜더스',
        'sub_options': ['SSG - 인천 SSG랜더스필드 (주중)', 'SSG - 인천 SSG랜더스필드 (금토일/공휴일)']
    },
    {
        'name': '삼성 라이온즈',
        'sub_options': ['삼성 - 대구 라이온즈 파크 (블루)', '삼성 - 대구 라이온즈 파크 (화이트)', '삼성 - 대구 라이온즈 파크 (그레이)']
    },
    {
        'name': 'NC 다이노스',
        'sub_options': ['NC - 창원NC파크']
    },
    {
        'name': '롯데 자이언츠',
        'sub_options': ['롯데 - 부산 사직 야구장 (주중)', '롯데 - 부산 사직 야구장 (금토일/공휴일)']
    },
    {
        'name': 'KIA 타이거즈',
        'sub_options': ['KIA - 광주 챔피언스 필드 (주중)', 'KIA - 광주 챔피언스 필드 (금토일/공휴일)']
    },
    {
        'name': '두산 베어스',
        'sub_options': ['두산 - 잠실야구장 (주중)', '두산 - 잠실야구장 (금토일/공휴일)']
    },
    {
        'name': '키움 히어로즈',
        'sub_options': ['키움 - 고척 돔 야구장 (주중)', '키움 - 고척 돔 야구장 (금토일/공휴일)']
    },
    {
        'name': 'KT wiz',
        'sub_options': ['KT - 수원 위즈 파크 (주중)', 'KT - 수원 위즈 파크 (금토일/공휴일)']
    }
]
